app/views/comments/_comment.html.erb

     <small>
       <%= comment.user.name %> commented <%= time_ago_in_words(comment.created_at) %> ago
---
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "new test after fix"], ["post_id", 34], ["user_id", 6], ["created_at", "2016-04-24 19:43:37.014715"], ["updated_at", "2016-04-24 19:43:37.014715"]]