app/views/comments/destroy.js.erb

<% if @comment.destroyed? %>
    $('#comment-<%= @comment.id %>').hide();
    $('.js-comments-count').html("<%= pluralize(@comment.user.comments.count, 'comment') %>");
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 101]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 6]]