app/views/users/show.html.erb

         <small>
           <%= pluralize(@user.posts.count, 'post') %>,
           <div class='js-comments-count'><%= pluralize(@user.comments.count, 'comment') %></div>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY rank DESC  [["user_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 9]]