app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments"  ORDER BY updated_at DESC
---
    def index
        comments = Comment.all

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ?  ORDER BY updated_at DESC LIMIT 1  [["id", 1]]
---
    def show
        comment = Comment.find(params[:id])