app/controllers/api/v1/posts_controller.rb

    def index
        posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY rank DESC

    def show
        post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 1]]