app/controllers/api/v1/topics_controller.rb

    def index
        topics = Topic.all
---
SELECT "topics".* FROM "topics"

    def show
        topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]