app/controllers/comments_controller.rb

    def create
        @resource = params[:topic_id] ? Topic.find(params[:topic_id]) : Post.find(params[:post_id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]