app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.new(comment_params)
        @comment.user = current_user
        @new_comment = Comment.new

        if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 38]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Add comment test"], ["post_id", 38], ["user_id", 7], ["created_at", "2016-04-14 02:41:33.482336"], ["updated_at", "2016-04-14 02:41:33.482336"]]

    def destroy
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])

        if @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 38]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ?  ORDER BY updated_at DESC LIMIT 1  [["post_id", 34], ["id", 101]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 102]]