app/controllers/favorites_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 49]]
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 49], ["user_id", 7], ["created_at", "2016-04-18 11:19:26.691096"], ["updated_at", "2016-04-18 11:19:26.691096"]]
---
    def create
        post = Post.find(params[:post_id])
        favorite = current_user.favorites.build(post: post)

        if favorite.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 49]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 7], ["id", 49]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
    def destroy
        post = Post.find(params[:post_id])
        favorite = current_user.favorites.find(params[:id])

        if favorite.destroy