app/controllers/posts_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "posts" ("title", "body", "topic_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "AUTHORIZE TEST"], ["body", "test on member authorizations "], ["topic_id", 8], ["user_id", 7], ["created_at", "2016-04-13 11:02:02.023120"], ["updated_at", "2016-04-13 11:02:02.023120"]]
---
  def create
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.build(post_params)
    @post.user = current_user
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 40]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Title Edit"], ["body", "Body Edit"], ["updated_at", "2016-04-09 03:32:27.610336"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.assign_attributes(post_params)

    if @post.save