app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cats"], ["description", "Posts about all the wonderful things about cats"], ["created_at", "2016-04-10 00:42:32.683627"], ["updated_at", "2016-04-10 00:42:32.683627"]]
---
    def create
        @topic = Topic.new
        @topic.name = params[:topic][:name]
        @topic.description = params[:topic][:description]
        @topic.public = params[:topic][:public]

        if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 16]]
UPDATE "topics" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["name", "Cats - EDIT"], ["description", "Posts about all the wonderful things about cats...edit...edit"], ["updated_at", "2016-04-10 01:27:09.836126"], ["id", 16]]
---
    def update
        @topic = Topic.find(params[:id])

        @topic.name = params[:topic][:name]
        @topic.description = params[:topic][:description]
        @topic.public = params[:topic][:public]

        if @topic.save